#+TITLE:Emacs Cheatsheat
#+AUTHOR:Joshua Branson
#+OPTIONS: H:10 toc:nil

*** org-babel
Org babel is a the best approach towards literate programming ever attempted, and it works!  Almost all programming languages treat code as the first order citizen and hides comments behind a simple syntax.  For example here is some javascript:

#+BEGIN_SRC js :exports code
  // initialize the variable
  var i = 5;
  if (i < 6) {
    i++;
  }
  console.log (i);
#+END_SRC

The comment "initialize the variable" comes after the comment syntax "//".  In literate programming the code portion of the file is "commented" and the comments do not hide behind a comment syntax.  Let me give you an example of the literate kind:

#+BEGIN_SRC org
  Let's write a trivial js function the literate way
  ,#+BEGIN_SRC js :exports code
    var i = 5;
    if (i < 6) {
      i++;
    }
    console.log (i);
  ,#+END_SRC
#+END_SRC

#+BEGIN_SRC calc
5 + 5
#+END_SRC

#+RESULTS:
: 10

How cool is that?
**** Specific header arguments
http://orgmode.org/manual/Specific-header-arguments.html
[[info:org#Specific%20header%20arguments][info:org#Specific header arguments]]

- :results
  syntax:
  :results [raw | silent | value | output ]
  value is function mode.  It means that org-mode will use the last executed command as the value of the output.
  ie:

#+BEGIN_SRC python :results value
import time
print("Hello, today's date is %s" % time.ctime())
print('Two plus two is')
return 2 + 2
#+END_SRC

  #+RESULTS:
  : 4

#+BEGIN_SRC sh :results output
  echo "hello world"
  echo "big cat"
  ls -lh | grep emacs.org
  #+END_SRC

#+RESULTS:
: hello world
: big cat
: -rw-r----- 1 joshua 1000  28K Mar  9 14:51 emacs.org

- :exports [code | results | node | both]
- :dir
  Specify a default directory that the code is to be run in
  :dir <dir>
